ErpTest/src/InformationRegisters/пкМобильныеКонфигурации/пкМобильныеКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкМобильныеКонфигурации</name>
  <resources>
    <name>Конфигурация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВерсияКонфигурации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.пкПользователиМП</types>
    </type>
  </resources>
  <resources>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Узел</name>
    <type>
      <types>ExchangePlanRef.пкОбменСМобильнымиУстройствами</types>
    </type>
  </resources>
  <resources>
    <name>ДатаРегистрации</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КодПодтверждения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.пкМобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСостояниеТехники/пкСостояниеТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСостояниеТехники</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.пкПоказателиСостоянияТехники</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.пкПоказателиСостоянияТехники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/InformationRegisters/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>пкСтатусыТехники</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.пкСтатусыТехники</types>
    </type>
  </resources>
  <resources>
    <name>ПланируемаяДатаЗавершения</name>
    <comment>Планируемая дата перехода в следующий статус (планируемая дата доставки, планируемая дата окончания ремонта)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЗаявкаНаАрендуТехники</name>
    <type>
      <types>DocumentRef.пкЗаявкаНаАрендуТехники</types>
    </type>
  </resources>
  <resources>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </resources>
  <dimensions>
    <name>Техника</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Enums/пкСтатусыТехники/пкСтатусыТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>пкСтатусыТехники</name>
  <enumValues>
    <name>НаБазе</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>ВПути</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
  <enumValues>
    <name>КВозврату</name>
  </enumValues>
  <enumValues>
    <name>Недоступен</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/Documents/пкПогрузкаВыгрузкаПоДоставке/пкПогрузкаВыгрузкаПоДоставке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>пкПогрузкаВыгрузкаПоДоставке</name>
  <comment>Погрузка/выгрузка техники по Доставке</comment>
  <registerRecords>InformationRegister.пкСтатусыТехники</registerRecords>
  <registerRecords>InformationRegister.пкСрокиАренды</registerRecords>
  <registerRecords>InformationRegister.пкСостояниеТехники</registerRecords>
  <registerRecords>InformationRegister.пкСтатусыРемонтаТехники</registerRecords>
  <registerRecords>InformationRegister.пкРезервТехники</registerRecords>
  <attributes>
    <name>Операция</name>
    <type>
      <types>EnumRef.пкОперацииПогрузкаВыгрузка</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставка</name>
    <type>
      <types>DocumentRef.пкДоставка</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеНаПеревозку</name>
    <type>
      <types>DocumentRef.пкЗаданиеНаПеревозку</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>Ответственный за доставку</comment>
    <type>
      <types>CatalogRef.ВнешниеПользователи</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательМП</name>
    <type>
      <types>CatalogRef.пкПользователиМП</types>
    </type>
  </attributes>
</mdclass:Document>

ErpTest/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>пкСкладскаяЯчейка</name>
    <type>
      <types>CatalogRef.СкладскиеЯчейки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/Catalogs/пкПользователиМП/пкПользователиМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>пкПользователиМП</name>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыАрендаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыЛогистика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыСогласованиеЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПраваЛогиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КогоЗамещает</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/ChartsOfCharacteristicTypes/пкПоказателиСостоянияТехники/пкПоказателиСостоянияТехники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>пкПоказателиСостоянияТехники</name>
  <type>
    <types>CatalogRef.СтруктураПредприятия</types>
    <types>String</types>
    <types>Number</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.СМ_ОбъектыСтроительства</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>10</length>
    </stringQualifiers>
  </type>
  <predefined>
    <items>
      <name>Местонахождения</name>
      <description>Местонахождения</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Склады</types>
        <types>CatalogRef.СМ_ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>Моточасы</name>
      <description>Моточасы</description>
      <code>000000003</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
    <items>
      <name>Подразделение</name>
      <description>Подразделение</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </items>
    <items>
      <name>ТемператураЗамерзанияОхлаждающейЖидкости</name>
      <description>Температура замерзания ох</description>
      <code>000000004</code>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

ErpTest/src/CommonModules/пкСинхронизацияСерверПереопределяемый/Module.bsl
// ЕСЛИ ИСПОЛЬЗОВАТЬ - ПОТРЕБУЕТСЯ ВВОД АДРЕСА ПОЧТЫ //
Функция пкИспользоватьДвухФакторнуюАвторизацию () Экспорт
	Возврат ЛОЖЬ;
КонецФункции      

// МОЖЕТ ЛИ ПОЛЬЗОВАТЕЛЬ ЗАРЕГИСТРИРОВАТЬСЯ ЧЕРЕЗ МОБИЛЬНОЕ УСТРОЙСТВО //
Функция пкДоступнаРегистрацияПользователей () Экспорт
	Возврат ЛОЖЬ;
КонецФункции	

// ПОД КАЖДУЮ КОНФИГУРАЦИЮ КОД МОЖЕТ БЫТЬ РАЗНЫМ //
Функция пкНайтиПользователя(СтрАвторизации,Ответ) Экспорт 
	
	Если ЗначениеЗаполнено(СтрАвторизации.КодСотрудника) Тогда 
		// АВТОРЕГИСТРАЦИЯ //
		Если пкДоступнаРегистрацияПользователей() И СтрАвторизации.КодСотрудника = "AUTO" Тогда
			УстановитьПривилегированныйРежим(Истина);
			мГруппа          = Константы.пкГруппаПользователейАвторегистрация.Получить();
			СЧ               = мГруппа.Пользователи.Количество() + 1;
			Спр              = Справочники.Пользователи.СоздатьЭлемент();
			Спр.Наименование = "ТП " + Формат(СЧ,"ЧЦ=5; ЧВН=; ЧГ=");
			//Спр.Служебный    = Истина;
			Спр.пкИдентификаторДляМобильногоУстройства = "AUTO" + Формат(СЧ,"ЧЦ=5; ЧВН=; ЧГ=");
			
			Описание = Пользователи.НовоеОписаниеПользователяИБ();
			Описание.Вставить("Имя",                       Спр.Наименование);
			Описание.Вставить("ПолноеИмя",                 Спр.Наименование);
			Описание.Вставить("АутентификацияOpenID",      Ложь);
			Описание.Вставить("АутентификацияСтандартная", Истина);
			Описание.Вставить("ПоказыватьВСпискеВыбора",   Ложь);
			Описание.Вставить("СтарыйПароль",              Неопределено);
			Описание.Вставить("Пароль",                    "");
			Описание.Вставить("СохраняемоеЗначениеПароля", Неопределено);
			Описание.Вставить("ПарольУстановлен",          Истина);
			Описание.Вставить("ЗапрещеноИзменятьПароль",   Ложь);
			Описание.Вставить("АутентификацияОС",          Ложь);
			Описание.Вставить("ПользовательОС",            "");
			Описание.Вставить("ВходВПрограммуРазрешен"     , Истина);
			Описание.Вставить("РежимЗапуска",              "Авто");
			Роли = Новый Массив;
			Роли.Добавить("пкДоступКМобильнойПодсистеме");
			Описание.Вставить("Роли",Роли);
			
			Описание.Вставить("Действие","Записать");
			
			Спр.ДополнительныеСвойства.Вставить("ОписаниеПользователяИБ",Описание);
			Спр.Записать();
			мГруппаОбъект            = мГруппа.ПолучитьОбъект();
			НоваяСтрока              = мГруппаОбъект.Пользователи.Добавить();
			НоваяСтрока.Пользователь = Спр.Ссылка;
			мГруппаОбъект.Записать();
			УстановитьПривилегированныйРежим(ЛОЖЬ);
			Возврат Спр.Ссылка;
		// АВТОРЕГИСТРАЦИЯ //
		ИначеЕсли пкИспользоватьДвухФакторнуюАвторизацию() ТОГДА	
			#Область ПоискФизлицаПоКонтактам 
			Запрос = Новый Запрос; 
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	КонтактнаяИнформация.Ссылка
			|ИЗ
			|	Справочник.Пользователи.КонтактнаяИнформация КАК КонтактнаяИнформация
			|ГДЕ
			|	КонтактнаяИнформация.Представление ПОДОБНО &Почта
			|	И КонтактнаяИнформация.Ссылка.ИдентификаторПользователяИБ = &ИдентификаторДляМобильногоУстройства"; 
			Запрос.УстановитьПараметр("ИдентификаторДляМобильногоУстройства",СокрЛП(СтрАвторизации.КодСотрудника)); 
			Запрос.УстановитьПараметр("Почта"                                  ,СокрЛП(СтрАвторизации.Почта)); 
			РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
			//Если нашли одного, то все отлично 
			Если РезультатЗапроса.Количество() = 1 Тогда 
				Возврат РезультатЗапроса[0].Ссылка; 
			Иначе //Если ни одного, или более одного - выдаем ошибку 
				Если РезультатЗапроса.Количество() = 0 Тогда 
					пкОбщийМодульСервер.пкЗаписатьОшибку(Ответ, "Не найдено ни одного сотрудника. (Код 2-4)"); 
				Иначе 
					пкОбщийМодульСервер.пкЗаписатьОшибку(Ответ, "Ошибка поиска сотрудника. (Код 2-5)"); 
				КонецЕсли; 
			КонецЕсли;
		// ПРОСТО ПОИСК ПОЛЬЗОВАТЕЛЯ ПО КОДУ //	
		Иначе
			ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоИмени(СтрАвторизации.КодСотрудника);
			Если ПользовательИБ = Неопределено ТОГДА
				пкОбщийМодульСервер.пкЗаписатьОшибку(Ответ, "Не найдено ни одного сотрудника. (Код 2-4)"); 
			Иначе
				УИД = ПользовательИБ.УникальныйИдентификатор;
			КонецЕсли;	
			Запрос = Новый Запрос; 
			Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	пкПользователиМП.Ссылка
			|ИЗ
			|	Справочник.пкПользователиМП КАК пкПользователиМП
			|ГДЕ
			|	пкПользователиМП.ИдентификаторПользователяИБ = &УИД"; 
			Запрос.УстановитьПараметр("УИД",УИД); 
			РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
			//Если нашли одного, то все отлично 
			Если РезультатЗапроса.Количество() >= 1 Тогда 
				Возврат РезультатЗапроса[0].Ссылка; 
			Иначе
				пкОбщийМодульСервер.пкЗаписатьОшибку(Ответ, "Ошибка поиска сотрудника. (Код 2-5)"); 
			КонецЕсли;	
		КонецЕсли; 	
		#КонецОбласти 
	Иначе 
		пкОбщийМодульСервер.пкЗаписатьОшибку(Ответ, "Сотрудник по коду не найден. (Код 2-6)"); 
		Возврат Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

// ПОД КАЖДУЮ КОНФИГУРАЦИЮ КОД МОЖЕТ БЫТЬ РАЗНЫМ //
Функция пкНайтиПочтуПользователя(Пользователь, Ответ) Экспорт
	//так как это двухфакторная авторизация, то мы должны брать адрес отправки из нашей базы, а не тот, 
	//который указывает пользователь, иначе это нифига не двухфакторная. Тоже самое касается и телефона 
	Запрос = Новый Запрос("ВЫБРАТЬ КИ.Представление ИЗ Справочник.Пользователи.КонтактнаяИнформация КАК КИ ГДЕ КИ.Ссылка = &Объект И КИ.Тип = &Тип"); 
	Запрос.УстановитьПараметр("Объект", Пользователь); 
	Запрос.УстановитьПараметр("Тип"   , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты); 
	РезультатЗапроса = Запрос.Выполнить().Выгрузить(); 
	Если РезультатЗапроса.Количество() = 1 Тогда 
		Возврат РезультатЗапроса[0].Представление; 
	Иначе //Если ни одного, или более одного - выдаем ошибку 
		Если РезультатЗапроса.Количество() = 0 Тогда 
			//Этот же кусок кода можно переписать и прописать создание пользователя с нуля. 
			пкОбщийМодульСервер.пкЗаписатьОшибку(Ответ, "Не найденно ни одного адреса почты. (Код 2-9)"); 
		Иначе 
			//Ну тут на самом деле можно и одну любую взять, или уточнить условие запроса. 
			пкОбщийМодульСервер.пкЗаписатьОшибку(Ответ, "Ошибка поиска почты. (Код 2-10)"); 
		КонецЕсли; 
	КонецЕсли; 
КонецФункции

// ПРИ ЗАГРУЗКЕ ДОКУМЕНТА //
Процедура пкПриЗагрузкеДокумента (СтрокаТЧ, НовыйЭл, УзелОбмена)  Экспорт
	Если УзелОбмена <> Неопределено Тогда
		НовыйЭл.ОбменДанными.Отправитель = УзелОбмена;
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	пкМобильныеКонфигурации.Пользователь
		|ИЗ
		|	РегистрСведений.пкМобильныеКонфигурации КАК пкМобильныеКонфигурации
		|ГДЕ
		|	пкМобильныеКонфигурации.Узел = &Узел";   
		Запрос.УстановитьПараметр("Узел",УзелОбмена);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			мПользователь = Выборка.Пользователь;
		Иначе
			мПользователь = Справочники.пкПользователиМП.ПустаяСсылка();
		КонецЕсли;
	Иначе	
		мПользователь = Справочники.пкПользователиМП.ПустаяСсылка();
	КонецЕсли;		
	
	Если ТипЗнч(НовыйЭл) = Тип ("ДокументОбъект.пкЗаявкаНаАрендуТехники") И НовыйЭл.ЭтоНовый() Тогда
		пкЗаявкаНаАрендуТехники_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь);
	ИначеЕсли ТипЗнч(НовыйЭл) = Тип ("ДокументОбъект.пкЗаданиеНаРемонт") Тогда
		пкЗаданиеНаРемонт_ПриЗагрузке(СтрокаТЧ,НовыйЭл,УзелОбмена,мПользователь);	
	ИначеЕсли ТипЗнч(НовыйЭл) = Тип ("ДокументОбъект.пкЗаказНаряд") Тогда
		пкЗаказНаряд_ПриЗагрузке(СтрокаТЧ,НовыйЭл,УзелОбмена,мПользователь);	
	ИначеЕсли ТипЗнч(НовыйЭл) = Тип ("ДокументОбъект.пкКоммерческоеПредложениеНаАрендуТехники") Тогда
		пкКоммерческоеПредложениеНаАрендуТехники_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь);
	ИначеЕсли ТипЗнч(НовыйЭл) = Тип ("ДокументОбъект.пкПогрузкаВыгрузкаПоДоставке") И НовыйЭл.ЭтоНовый() Тогда
		пкПогрузкаВыгрузкаПоДоставке_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь);
	ИначеЕсли ТипЗнч(НовыйЭл) = Тип ("ДокументОбъект.пкЗаданиеНаПеревозку") Тогда
		пкЗаданиеНаПеревозку_ПриЗагрузке(СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь);
	КонецЕсли;	
	
КонецПроцедуры

Процедура пкЗаданиеНаПеревозку_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь)
	Если НовыйЭл.ЭтоНовый() Тогда
		Если ЗначениеЗаполнено(НовыйЭл.ЗаявкаНаАрендуТехники) Тогда
			НовыйЭл.Подразделение = НовыйЭл.ЗаявкаНаАрендуТехники.Подразделение;
		КонецЕсли;
	//	Если Не ЗначениеЗаполнено(НовыйЭл.Менеджер) Тогда
	//		НовыйЭл.Менеджер = мПользователь.Пользователь;
	//	КонецЕсли;		
	//	мДанныеТехники = ПолучитьКлиентаОбъектСтроительстваПоТехнике(НовыйЭл.ОбъектЭксплуатации,НовыйЭл.Дата);
	//	Если мДанныеТехники <> Неопределено Тогда
	//		ЗаполнитьЗначенияСвойств(НовыйЭл,мДанныеТехники);
	//	КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры


Процедура пкЗаданиеНаРемонт_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь)
	Если НовыйЭл.ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(НовыйЭл.Организация) Тогда
			НовыйЭл.Организация = мПользователь.Организация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовыйЭл.Менеджер) Тогда
			НовыйЭл.Менеджер = мПользователь.Пользователь;
		КонецЕсли;		
		мДанныеТехники = ПолучитьКлиентаОбъектСтроительстваПоТехнике(НовыйЭл.ОбъектЭксплуатации,НовыйЭл.Дата);
		Если мДанныеТехники <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭл,мДанныеТехники);
		КонецЕсли;	
	КонецЕсли;	
КонецПроцедуры

Процедура пкЗаказНаряд_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь)
	
	Если НовыйЭл.ЭтоНовый() Тогда
		Если Не ЗначениеЗаполнено(НовыйЭл.Организация) Тогда
			НовыйЭл.Организация = мПользователь.Организация;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(НовыйЭл.Ответственный) Тогда
			НовыйЭл.Ответственный = мПользователь.Пользователь;
		КонецЕсли;
	КонецЕсли;
	
	ТабРаботы       = СтрокаТЧ.Работы.Скопировать();
	ТабРаботы.Колонки.Добавить("Обработан",Новый ОписаниеТипов("Булево"));
	Запрос          = Новый Запрос;
	Запрос.Текст    = "ВЫБРАТЬ *,ЛОЖЬ КАК Обработан ИЗ Документ.пкЗаказНаряд.Работы ГДЕ Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",СтрокаТЧ.Ссылка);
	ТабРаботыСтарые = Запрос.Выполнить().Выгрузить(); 
	НовыйЭл.Работы.Очистить();
	СтрокиКУдалению = Новый Массив;
	Для Каждого СтрокаРабот Из ТабРаботыСтарые Цикл
		ИскомыеСтроки = ТабРаботы.НайтиСтроки(Новый Структура("Номенклатура,Обработан",СтрокаРабот.Номенклатура,ЛОЖЬ));
		Если ИскомыеСтроки.Количество() = 0 Тогда
			СтрокиКУдалению.Добавить(СтрокаРабот);
		Иначе
			ИскомаяСтрока = ИскомыеСтроки[0];
			НоваяСтрока   = НовыйЭл.Работы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаРабот);
			ЗаполнитьЗначенияСвойств(НоваяСтрока,ИскомаяСтрока);
			ИскомаяСтрока.Обработан = Истина;
			СтрокаРабот.Обработан   = Истина;
		КонецЕсли;	
	КонецЦикла;
	Для Каждого ИскомаяСтрока Из ТабРаботы.НайтиСтроки(Новый Структура("Обработан",ЛОЖЬ)) Цикл
		НоваяСтрока            = НовыйЭл.Работы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,ИскомаяСтрока);
		НоваяСтрока.ВидРемонта = НовыйЭл.ВидРемонта;
	КонецЦикла;
	
	Если НовыйЭл.ЭтоНовый() Тогда
		мДанныеТехники = ПолучитьКлиентаОбъектСтроительстваПоТехнике(НовыйЭл.Техника,НовыйЭл.Дата);
		Если мДанныеТехники <> Неопределено Тогда
			ЗаполнитьЗначенияСвойств(НовыйЭл,мДанныеТехники);
		КонецЕсли;	
		НовыйЭл.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		
		// Rarus-spb byse {
		// Запрос 4289 
		Если НовыйЭл.ПлатныйРемонт Тогда
			НовыйЭл.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;	
		// Rarus-spb byse }
		
		// Rarus-spb byse {
		// Запрос 9778 
		Если НовыйЭл.ПлатныйРемонт Тогда
			НовыйЭл.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("00-000128"); // Запчасти для платного ремонта (договоры аренды)
			Если Не ЗначениеЗаполнено(НовыйЭл.СтатьяРасходов) Тогда
				НовыйЭл.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Запчасти для платного ремонта (договоры аренды)"); // Запчасти для платного ремонта (договоры аренды)
			КонецЕсли;
		Иначе 
			НовыйЭл.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("00-000132"); // Запчасти для ремонта подъемников на базе
			Если Не ЗначениеЗаполнено(НовыйЭл.СтатьяРасходов) Тогда
				НовыйЭл.СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоНаименованию("Запчасти для ремонта подъемников на базе"); // Запчасти для ремонта подъемников на базе
			КонецЕсли;
		КонецЕсли;	
		// Rarus-spb byse }
		
	КонецЕсли;	
	
	
	
КонецПроцедуры	

Процедура пкЗаявкаНаАрендуТехники_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь)
	Если Не ЗначениеЗаполнено(НовыйЭл.Менеджер) Тогда
		НовыйЭл.Менеджер  = НовыйЭл.Партнер.ОсновнойМенеджер;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НовыйЭл.Автор) Тогда
		НовыйЭл.Автор     = НовыйЭл.ПользовательМП.Пользователь;
	КонецЕсли;
	Для Каждого СтрокаТаб Из НовыйЭл.Товары Цикл
		СтрокаТаб.ДатаОтгрузки = СтрокаТаб.ДатаНачалаАренды;
		СтрокаТаб.ДатаВозврата = СтрокаТаб.ДатаОкончанияАренды;
		СтрокаТаб.Упаковка     = СтрокаТаб.Номенклатура.ЕдиницаИзмерения;	
		СтрокаТаб.Количество   = СтрокаТаб.КоличествоУпаковок;
	КонецЦикла;	
	ДокСсылка = Документы.пкЗаявкаНаАрендуТехники.НайтиПоНомеру(НовыйЭл.Номер,НовыйЭл.Дата);
	Если ЗначениеЗаполнено(ДокСсылка) И ДокСсылка <> СтрокаТЧ.Ссылка Тогда
		НовыйЭл.УстановитьНовыйНомер();
		ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,СтрокаТЧ.Ссылка);
	КонецЕсли;	
	//НовыйЭл.Проведен  = ЛОЖЬ;
	//СтрокаТЧ.Проведен = ЛОЖЬ;
КонецПроцедуры

Процедура пкКоммерческоеПредложениеНаАрендуТехники_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь)
	НовыйЭл.ТипыТехники.Очистить();
	Для Каждого СтрокаТовары Из НовыйЭл.Товары Цикл 
		мТипТехники = СтрокаТовары.Номенклатура.пкТипТехники;
		Если НовыйЭл.ТипыТехники.Найти(мТипТехники) = Неопределено Тогда
			НоваяСтрока = НовыйЭл.ТипыТехники.Добавить();
			НоваяСтрока.ТипТехники = мТипТехники;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура пкПогрузкаВыгрузкаПоДоставке_ПриЗагрузке (СтрокаТЧ, НовыйЭл, УзелОбмена, мПользователь)
		НовыйЭл.Автор         = НовыйЭл.ПользовательМП.Пользователь;
		НовыйЭл.Ответственный = НовыйЭл.ПользовательМП.Пользователь;
		ДокСсылка = Документы.пкПогрузкаВыгрузкаПоДоставке.НайтиПоНомеру(НовыйЭл.Номер,НовыйЭл.Дата);
		Если ЗначениеЗаполнено(ДокСсылка) И ДокСсылка <> СтрокаТЧ.Ссылка Тогда
			НовыйЭл.УстановитьНовыйНомер();
			ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена,СтрокаТЧ.Ссылка);
		КонецЕсли;
КонецПроцедуры
	
Функция ПолучитьКлиентаОбъектСтроительстваПоТехнике (Техника, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	пкСостояниеТехникиСрезПоследних.Значение КАК ОбъектСтроительства,
	|	ВЫБОР
	|		КОГДА пкСостояниеТехникиСрезПоследних.Регистратор ССЫЛКА Документ.пкПогрузкаВыгрузкаПоДоставке
	|			ТОГДА пкСостояниеТехникиСрезПоследних.Регистратор.ЗаданиеНаПеревозку.ЗаявкаНаАрендуТехники.Партнер
	|		ИНАЧЕ пкСостояниеТехникиСрезПоследних.Значение.Заказчик.Партнер
	|	КОНЕЦ КАК Клиент
	|ИЗ
	|	РегистрСведений.пкСостояниеТехники.СрезПоследних(
	|			&Дата,
	|			Техника = &Техника
	|				И Показатель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.пкПоказателиСостоянияТехники.Местонахождения)) КАК пкСостояниеТехникиСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.пкСтатусыТехники.СрезПоследних(&Дата, Техника = &Техника) КАК пкСтатусыТехникиСрезПоследних
	|		ПО пкСостояниеТехникиСрезПоследних.Техника = пкСтатусыТехникиСрезПоследних.Техника
	|ГДЕ
	|	пкСтатусыТехникиСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.пкСтатусыТехники.ВАренде)";
	Запрос.УстановитьПараметр("Дата", Период);
	Запрос.УстановитьПараметр("Техника", Техника);
	
	Результат = Запрос.Выполнить();
	
	Если Не Результат.Пустой() Тогда 
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		СтруктураВозврата = Новый Структура("Клиент,ОбъектСтроительства");
		ЗаполнитьЗначенияСвойств(СтруктураВозврата,Выборка);
		Возврат СтруктураВозврата;
	Иначе 
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции
